jmeter/ai-sport-upload-poll.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="AI-Sport Upload Polling Plan" enabled="true">
      <stringProp name="TestPlan.comments">5并发上传短视频并轮询分析结果，统计端到端耗时</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Upload Data CSV" enabled="true">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="filename">${__P(CSV_PATH,jmeter/testdata/upload_cases.csv)}</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="variableNames">video_file,username,password,exercise_type</stringProp>
      </CSVDataSet>
      <hashTree/>

      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${__P(HOST,127.0.0.1)}</stringProp>
        <stringProp name="HTTPSampler.port">${__P(PORT,8080)}</stringProp>
        <stringProp name="HTTPSampler.protocol">${__P(PROTOCOL,http)}</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Common Headers" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">Bearer ${auth_token}</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Upload+Poll Threads" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <stringProp name="LoopController.loops">-1</stringProp>
          <boolProp name="LoopController.continue_forever">true</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(DURATION_SEC,60)}</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/users/login" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;username&quot;:&quot;${username}&quot;,&quot;password&quot;:&quot;${password}&quot;}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/users/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">${__P(CONNECT_TIMEOUT_MS,10000)}</stringProp>
          <stringProp name="HTTPSampler.response_timeout">${__P(RESPONSE_TIMEOUT_MS,60000)}</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Login Content-Type Header" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>

          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Login Status 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>

          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract auth token" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">auth_token</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.token</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">EMPTY</stringProp>
            <stringProp name="JSONPostProcessor.compute_concat">false</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/videos/upload" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="username" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">username</stringProp>
                <stringProp name="Argument.value">${username}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="exerciseType" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">exerciseType</stringProp>
                <stringProp name="Argument.value">${exercise_type}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <elementProp name="HTTPsampler.Files" elementType="HTTPFileArgs">
            <collectionProp name="HTTPFileArgs.files">
              <elementProp name="" elementType="HTTPFileArg">
                <stringProp name="File.path">${video_file}</stringProp>
                <stringProp name="File.paramname">file</stringProp>
                <stringProp name="File.mimetype">video/mp4</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/videos/upload</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">true</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">${__P(CONNECT_TIMEOUT_MS,10000)}</stringProp>
          <stringProp name="HTTPSampler.response_timeout">${__P(RESPONSE_TIMEOUT_MS,60000)}</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Upload Status 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>

          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract videoId" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">video_id</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.videoId</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">EMPTY</stringProp>
            <stringProp name="JSONPostProcessor.compute_concat">false</stringProp>
          </JSONPostProcessor>
          <hashTree/>

          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Init E2E Context" enabled="true">
            <stringProp name="cacheKey">init-e2e-context</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">def vid = vars.get('video_id')
if (vid == null || vid == '' || vid == 'EMPTY') {
    prev.setSuccessful(false)
    prev.setResponseMessage('upload ok but videoId missing in JSON body')
}
vars.put('poll_done', 'false')
vars.put('final_status', '')
vars.put('e2e_start_ms', String.valueOf(System.currentTimeMillis()))</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>

        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If videoId exists" enabled="true">
          <stringProp name="IfController.condition">${__groovy(!(vars.get('video_id') == null || vars.get('video_id') == '' || vars.get('video_id') == 'EMPTY'))}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Poll Loop" enabled="true">
            <stringProp name="LoopController.loops">${__P(POLL_MAX,120)}</stringProp>
            <boolProp name="LoopController.continue_forever">false</boolProp>
          </LoopController>
          <hashTree>
            <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If polling not finished" enabled="true">
              <stringProp name="IfController.condition">${__groovy(vars.get('poll_done') != 'true')}</stringProp>
              <boolProp name="IfController.evaluateAll">false</boolProp>
              <boolProp name="IfController.useExpression">true</boolProp>
            </IfController>
            <hashTree>
              <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/videos/${video_id}/analysis" enabled="true">
                <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
                  <collectionProp name="Arguments.arguments"/>
                </elementProp>
                <stringProp name="HTTPSampler.path">/api/videos/${video_id}/analysis</stringProp>
                <stringProp name="HTTPSampler.method">GET</stringProp>
                <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
                <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
                <stringProp name="HTTPSampler.connect_timeout">${__P(CONNECT_TIMEOUT_MS,10000)}</stringProp>
                <stringProp name="HTTPSampler.response_timeout">${__P(RESPONSE_TIMEOUT_MS,60000)}</stringProp>
              </HTTPSamplerProxy>
              <hashTree>
                <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Poll Status in 200/202/500/409" enabled="false">
                  <collectionProp name="Asserion.test_strings">
                    <stringProp name="1">200</stringProp>
                    <stringProp name="2">202</stringProp>
                    <stringProp name="3">500</stringProp>
                    <stringProp name="4">409</stringProp>
                  </collectionProp>
                  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                  <boolProp name="Assertion.assume_success">false</boolProp>
                  <intProp name="Assertion.test_type">2</intProp>
                </ResponseAssertion>
                <hashTree/>

                <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Update Polling State" enabled="true">
                  <stringProp name="cacheKey">update-poll-state</stringProp>
                  <stringProp name="scriptLanguage">groovy</stringProp>
                  <stringProp name="script">def code = prev.getResponseCode()
def body = prev.getResponseDataAsString()
def status = null

if (body != null &amp;&amp; body.trim().length() &gt; 0) {
    try {
        def json = new groovy.json.JsonSlurper().parseText(body)
        status = json.status
    } catch (Exception ignored) {
    }
}

if (code == '202') {
    vars.put('poll_done', 'false')
    vars.put('final_status', status ?: 'PROCESSING')
} else if (code == '200') {
    vars.put('poll_done', 'true')
    vars.put('final_status', status ?: 'COMPLETED')
} else if (code == '500' || code == '409') {
    vars.put('poll_done', 'true')
    vars.put('final_status', status ?: 'FAILED')
} else if (code == '404') {
    vars.put('poll_done', 'true')
    vars.put('final_status', 'NOT_FOUND')
} else {
    vars.put('poll_done', 'false')
}</stringProp>
                </JSR223PostProcessor>
                <hashTree/>
              </hashTree>

              <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Poll Interval" enabled="true">
                <stringProp name="ConstantTimer.delay">${__P(POLL_INTERVAL_MS,1000)}</stringProp>
              </ConstantTimer>
              <hashTree/>
            </hashTree>
          </hashTree>

          <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If COMPLETED emit E2E metric" enabled="true">
            <stringProp name="IfController.condition">${__groovy(vars.get('final_status') == 'COMPLETED')}</stringProp>
            <boolProp name="IfController.evaluateAll">false</boolProp>
            <boolProp name="IfController.useExpression">true</boolProp>
          </IfController>
          <hashTree>
                <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="E2E_COMPLETE_MS" enabled="true">
              <stringProp name="cacheKey">e2e-complete-ms</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
                  <stringProp name="script">long startMs = (vars.get('e2e_start_ms') ?: '0') as long
long now = System.currentTimeMillis()
long elapsed = Math.max(0L, now - startMs)

SampleResult.setSampleLabel('E2E_COMPLETE_MS')
SampleResult.setStartTime(startMs)
SampleResult.setEndTime(startMs + elapsed)
SampleResult.setSuccessful(true)
SampleResult.setResponseCodeOK()
SampleResult.setResponseMessage('videoId=' + vars.get('video_id'))
SampleResult.setResponseData(('elapsed_ms=' + elapsed).getBytes('UTF-8'))</stringProp>
            </JSR223Sampler>
            <hashTree/>
          </hashTree>

          <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If FAILED/NOT_FOUND mark failure" enabled="true">
            <stringProp name="IfController.condition">${__groovy(vars.get('final_status') == 'FAILED' || vars.get('final_status') == 'NOT_FOUND')}</stringProp>
            <boolProp name="IfController.evaluateAll">false</boolProp>
            <boolProp name="IfController.useExpression">true</boolProp>
          </IfController>
          <hashTree>
                <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="E2E_FAILED" enabled="true">
              <stringProp name="cacheKey">e2e-failed</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
                  <stringProp name="script">long startMs = (vars.get('e2e_start_ms') ?: '0') as long
long now = System.currentTimeMillis()
long elapsed = Math.max(0L, now - startMs)

SampleResult.setSampleLabel('E2E_FAILED')
SampleResult.setStartTime(startMs)
SampleResult.setEndTime(startMs + elapsed)
SampleResult.setSuccessful(false)
SampleResult.setResponseCode('500')
SampleResult.setResponseMessage('final_status=' + vars.get('final_status') + ', videoId=' + vars.get('video_id'))
SampleResult.setResponseData(('elapsed_ms=' + elapsed).getBytes('UTF-8'))</stringProp>
            </JSR223Sampler>
            <hashTree/>
          </hashTree>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>